export const AccountManagement = {
    '1001': '信箱為必填',
    '1002': '信箱格式錯誤',
    '1003': '信箱已被使用，請換一個信箱',
    '1004': 'ChannelID 為必填',
    '1005': 'ChannelID 格式錯誤',
    '1006': 'ChannelID 已被使用，請換一個 ChannelID',
    '1011': '密碼為必填',
    '1012': '確認密碼為必填',
    '1013': '密碼與確認密碼不相符',
    '1014': '密碼更新失敗',
    '1021': '角色為必填',
    '1022': '角色不存在',
    '1023': '角色錯誤',
    '1031': 'Token 無效',
    '1032': 'Token 無效',
    '1033': 'Token 已過期，請重新獲取驗證信',
    '1034': 'Token 無效，請重新獲取驗證信',
    '1050': '建立帳號失敗',
    '1060': '帳號尚未驗證，請至信箱驗證',
    '1061': '帳號已驗證',
    '1062': '帳號已被禁用，請聯繫管理員',
    '1063': '帳號更新失敗',
    '1064': '帳號不存在',
    '1070': '帳號或密碼錯誤',
    '1080': '檔案為必填',
    '1081': '檔案格式錯誤',
    '2000': '查無資料',
    '5000': '查無使用者',
    '6000': '資料儲存失敗，請稍後再試',
    'default': '發生錯誤，請稍後再試'
};

export const PaymentOrder = {
    '1001': 'Project 不存在',
    '1002': '贊助金額不可少於最低金額',
    'default': '發生錯誤，請稍後再試'
}